dis_opt = ["[ 해피포인트 적립 ]","[ KT 멤버십 할인 ]", "[ T 멤버십 할인 ]", "[ 블루멤버쉽 할인 ]", "[ 임직원 할인 ]"]


categories = [
    "🍦 아이스크림",
    "☕ 커피",
    "🍰 케이크",
    "🍮 디저트"
]

icecream_menu = {
    "싱글 레귤러 - 한가지 맛 (중량 115g)": 3900,
    "싱글 킹 - 한가지 맛 (중량 145g)": 4700,
    "더블 주니어 - 두가지 맛 (중량 150g)": 5100,
    "더블 레귤러 - 두가지 맛 (중량 230g)": 7300,
    "파인트 - 세가지 맛 (중량 320g)": 9800,
    "쿼터 - 네가지 맛 (중량 620g)": 18500,
    "패밀리 - 다섯가지 맛 (중량 960g)": 26000,
    "하프 갤런 - 여섯가지 맛 (중량 1200g)": 31500,
}

icecream_count = {
    "싱글 레귤러 - 한가지 맛 (중량 115g)": 1,
    "싱글 킹 - 한가지 맛 (중량 145g)": 1,
    "더블 주니어 - 두가지 맛 (중량 150g)": 2,
    "더블 레귤러 - 두가지 맛 (중량 230g)": 2,
    "파인트 - 세가지 맛 (중량 320g)": 3,
    "쿼터 - 네가지 맛 (중량 620g)": 4,
    "패밀리 - 다섯가지 맛 (중량 960g)": 5,
    "하프 갤런 - 여섯가지 맛 (중량 1200g)": 6,
}

icecream_flavors = [
    "🐻 봄날의 곰을 좋아하세요?",
    "🍩 아이 원-츄!",
    "🍈 아이스 칸탈로프 멜론",
    "🍑 피치 요거트",
    "🥭 망고 탱고",
    "🔥 치토스 밀크쉐이크 아이스크림",
    "🍯 허니 크런치",
    "🍞 아이스 메론빵",
    "🫐 블루베리 파나코타",
    "🦖 디노 젤리",
    "🧂 소금 우유 아이스크림",
    "🍏 애플 민트",
    "🍇 청포도 샤베트",
    "👽 엄마는 외계인",
    "🌿 민트 초콜릿 칩",
    "🧀 뉴욕 치즈케이크",
    "🌈 레인보우 샤베트",
    "🍒 체리쥬빌레",
    "💥 슈팅스타",
    "🍪 오레오 쿠키 앤 크림",
    "🍓 베리베리 스트로베리",
    "🥄 31요거트",
    "🌬️ 바람과 함께 사라지다",
    "🍭 이상한 나라의 솜사탕",
    "🥜 피스타치오 아몬드",
    "🍵 그린티",
    "🍫 초콜릿",
    "🥜 아몬드 봉봉"
]

coffee_menu = {
    "☕ 아메리카노": 3500,
    "🥛 카페라떼": 4000,
    "🍦 바닐라빈 라떼": 4500,
    "🍮 카라멜 마끼아또": 4700,
    "👽 엄마는 외계인 카페모카": 5200,
    "🥫 연유라떼": 4300,
    "🎉 카페31": 4800,
    "🍨 아포가토 라떼": 5000,
    "🧊 콜드브루 아메리카노": 4200,
    "🥶 콜드브루 라떼": 4700,
    "🌰 콜드브루 오트": 4900,
    "🍰 슈크림 아포가토 블라스트": 5300,
    "🍭 슈가밤 커피": 4600,
    "🍧 슈가밤 블라스트": 5300,
    "🍦 아포가토": 4500
}


icecream_cake_menu = {
    "🍇 더 듬뿍 청포도 케이크": 32000,
    "🍑 더 듬뿍 복숭아 케이크": 32000,
    "🌸 플라워 베리 케이크": 33000,
    "🌼 플라워 블라썸 케이크": 33000,
    "🐰 미피와 신나는 애니멀 파크": 36000,
    "🐧 뽀로로와 즐거운 피크닉 타임": 36000,
    "🎀 네모 블록 헬로키티": 34000,
    "🐭 네모 블록 미키 마우스": 34000,
    "🍵 그린티 킷캣 떠먹는 큐브": 30000,
    "🍎 달콤한 비밀 속 백설공주": 33000,
    "🥭 더 듬뿍 망고 케이크": 32000,
    "🍓 더 듬뿍 딸기 케이크": 32000,
    "🍫 진정한 초콜릿 케이크": 31000,
    "🍠 진정한 고구마 케이크": 31000,
    "🧀 진정한 치즈 케이크": 31000,
    "☕ 진정한 티라미수 케이크": 31000,
    "🍪 1979 쿠앤크 떠먹는 큐브": 30000,
    "🎉 나눠먹는 와츄원": 29000,
    "🧊 나눠먹는 큐브 와츄원": 29000,
    "🧁 골라먹는 27 큐브": 35000,
    "🎂 해피 버스데이": 33000,
    "🪐 듀얼 와츄원 NO.9": 37000,
    "👽 우주에서 온 엄마는 외계인": 34000,
    "🍰 골라먹는 와츄원": 31000,
    "🧁 미니 골라먹는 와츄원": 23000,
    "🎈 미니 해피 버스데이 케이크": 23000
}

dessert_menu = {
    "🥛 쿠키 크런치 선데": 4100,
    "🍨 더 듬뿍 설향딸기 컵빙수": 5200,
    "🍪 더 듬뿍 설향딸기 빙수": 4700,
    "🍠 더 듬뿍 칸탈로프 멜론 컵빙수": 4000,
    "🍠 더 듬뿍 칸탈로프 멜론빙수": 5700,
    "🍪 버터 쿠키 샌드 세트 (4개입)": 4400,
    "🍫 더 듬뿍 팥빙수": 5600,
    "🥮 더 듬뿍 팥 컵빙수": 5400,
    "🍵 카페 크런치 선데": 5300,
    "🍈 버터 쿠키 샌드 애플 시나몬": 5200,
    "🍵 버터 쿠키 샌드 바닐라 카라멜": 4400,
    "🍈 그린티 킷캣 선데": 4400,
    "🍵 아이스 청크쿠키 샌드 밀크": 4500,
    "🍡 그린티 킷캣 초콜릿 스틱바": 5300,
    "🍡 아이스 마카롱 크림브륄레": 4300,
    "🧊 컨디션 스틱바 그린애플": 4700,
    "🍰 아이스 초코 도쿄바나나 쿠키 샌드": 5300,
    "🧁 아이스 꿀떡": 4900,
    "🍡 홀리데이 미니 아이스 마카롱": 5500,
    "🍵 DIY 모나카 세트": 5200,
    "🍰 아이스 모찌 밤 티라미수": 4100,
    "🍪 우석이도 외계인 선데": 5200,
    "🍦 아몬드봉봉모찌": 4300,
    "🥛 아이스 모찌 슈크림": 5400,
    "🍠 마이멜로디 스틱바 딸기 요거트": 4800,
    "🍪 쿠로미 스틱바 블랙소르베 제로": 3900,
    "🍈 아이스 쿠키 샌드 바닐라": 3800,
    "🍠 맥심 스틱바 모카골드 마일드": 5000,
    "🍪 아이스 마카롱 체리쥬빌레": 3800,
    "🍈 아이스 마카롱 쿠키앤크림": 5500,
    "🥮 아이스 모나카 쫀떡 인절미": 5000,
    "🧊 아이스 모나카 우유": 4400,
    "🍓 아이스 모찌 소금우유": 4600,
    "🍡 아이스 모찌 그린티": 4500,
    "🥮 아이스 모찌 스트로베리": 5400,
    "🧁 아이스 모찌 초코바닐라": 5700,
    "🍰 아이스 모찌 크림치즈": 4800
}

happy_num = [67194643 ,
32312118 ,
69577544 ,
77735186 ,
22469744 ,
93409044 ,
88777531 ,
80991908 ,
19183225 ,
64283561]

kt_num = [1671875914 ,
4884128775 ,
6318622148 ,
2446379550 ,
6196709063 ,
4078657025 ,
1054992472 ,
4556938008 ,
2846211927 ,
2384927163]

t_num = [1069883468 ,
7777629993 ,
7721485658 ,
1061224587 ,
1943303252 ,
9466219173 ,
4171899431 ,
1016767824 ,
4866895492 ,
5988361843]


blu_mem_num = [1069883468 ,
7777629993 ,
7721485658 ,
1061224587 ,
1943303252 ,
9466219173 ,
4171899431 ,
1016767824 ,
4866895492 ,
5988361843]

worker_id = [930072 ,
942234 ,
556227 ,
991209 ,
430002 ,
715215 ,
267551 ,
305145 ,
505973 ,
179978, 517109]


payment_opt_add_coup = [559347851816 ,
625013772188 ,
198206480718 ,
463353370999 ,
588333004086 ,
658380070506 ,
846496835709 ,
960324798248 ,
291295106315 ,
505730469030]

payment_type_lst = ['[ 신 용 카 드 ]','[ 모바일 교환권 ]']